tap "clojure/tools"
tap "coursier/formulas"
tap "d12frosted/emacs-plus"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "microsoft/git"
tap "microsoft/mssql-release"
tap "pkgxdev/made"
tap "scalacenter/bloop"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Next generation open source RPC library and framework
brew "grpc"
# Framework for scalable cross-language services development
brew "thrift"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk@17"
# Engine for large-scale data processing
brew "apache-spark"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Text processing scripting language
brew "awk"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion", link: false
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Parser generator
brew "bison"
# New way to see and navigate directory trees
brew "broot"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Git-powered personal task tracker
brew "dstask"
# GNU compiler collection
brew "gcc"
# Package for scientific computing with Python
brew "numpy", link: false
# Git for data science projects
brew "dvc"
# Spellchecker wrapping library
brew "enchant"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Generic library support script
brew "libtool"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Platform built on V8 to build network applications
brew "node"
# High precision scientific calculator with support for physical units
brew "insect"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# LastPass command-line interface tool
brew "lastpass-cli"
# Build tool for Clojure
brew "leiningen"
# Portable Foreign Function Interface library
brew "libffi"
# LLVM's OpenMP runtime library
brew "libomp"
# Postgres C API library
brew "libpq"
# Bare libuv bindings for lua
brew "luv"
# Securely transfers data between computers
brew "magic-wormhole"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# General-purpose scripting language
brew "php"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Modern replacement for ps written by Rust
brew "procs"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Bindings to the libgit2 shared library
brew "pygit2"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Safe, concurrent, practical language
brew "rust"
# JVM-based programming language
brew "scala"
# Cross-shell prompt for astronauts
brew "starship"
# Command-line time tracking application
brew "timewarrior"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The Clojure Programming Language
brew "clojure/tools/clojure"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@28"
# Vault
brew "hashicorp/tap/vault"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Run Anything
brew "pkgxdev/made/pkgx"
# Installs the Bloop CLI for Bloop, a build server to compile, test and run Scala fast
brew "scalacenter/bloop/bloop"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Web browser focusing on privacy
cask "brave-browser"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
cask "font-source-code-pro"
# Git client focusing on productivity
cask "gitkraken"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Desktop automation application
cask "hammerspoon"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Minimal installer for conda
cask "miniconda"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source PostgreSQL GUI client
cask "postbird"
# Collaboration platform for API development
cask "postman"
# App that enables mouse-free UI interaction
cask "shortcat"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Active space menu bar icon
cask "whichspace"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "1Blocker", id: 1365531024
mas "1Password 7", id: 1333542190
mas "Apnea Trainer", id: 1216253186
mas "Express Scribe Transcription", id: 1163880535
mas "Freeze", id: 1046095491
mas "GarageBand", id: 682658836
mas "GitHub Wiki Search", id: 1594190145
mas "iMovie", id: 408981434
mas "iReal Pro", id: 409035833
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Notability", id: 360593530
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "PDF Reader Pro Lite", id: 919472673
mas "PocketTube", id: 1533703891
mas "Prime Video", id: 545519333
mas "Save to Raindrop.io", id: 1549370672
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Tempus Stopwatch", id: 1491326665
mas "The Unarchiver", id: 425424353
mas "Time Out", id: 402592703
mas "Toggl Track", id: 1291898086
mas "Transcriptions", id: 911974149
mas "Trello", id: 1278508951
