tap "clojure/tools"
tap "coursier/formulas"
tap "d12frosted/emacs-plus"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "microsoft/git"
tap "microsoft/mssql-release"
tap "pkgxdev/made"
tap "scalacenter/bloop"
brew "libyaml"
brew "readline"
brew "xz"
brew "ansible"
brew "aom"
brew "grpc"
brew "thrift"
brew "apache-arrow"
brew "gettext"
brew "glib"
brew "harfbuzz"
brew "openjdk@17"
brew "apache-spark"
brew "automake"
brew "awk"
brew "bash"
brew "bash-completion", link: false
brew "libgit2"
brew "bat"
brew "bat-extras"
brew "bfg"
brew "bison"
brew "chruby"
brew "cmake"
brew "coreutils"
brew "curl"
brew "direnv"
brew "dstask"
brew "gcc"
brew "numpy", link: false
brew "dvc"
brew "enchant"
brew "exercism"
brew "eza"
brew "fd"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "libtool"
brew "freetds"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git"
brew "pkg-config"
brew "gobject-introspection"
brew "librsvg"
brew "graphviz"
brew "httpie"
brew "node"
brew "insect"
brew "jq"
brew "krb5"
brew "lastpass-cli"
brew "leiningen"
brew "libffi"
brew "libomp"
brew "libpq"
brew "luv"
brew "magic-wormhole"
brew "mas"
brew "ncurses"
brew "neovim"
brew "ninja"
brew "nvm"
brew "openssl@1.1"
brew "openvpn"
brew "tree"
brew "pass"
brew "php"
brew "pipenv"
brew "pipx"
brew "poppler"
brew "postgresql@14", restart_service: true
brew "procs"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygit2"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "ranger"
brew "ripgrep"
brew "ruby-install"
brew "scala"
brew "starship"
brew "tldr"
brew "tmux"
brew "wget"
brew "xsv"
brew "yamllint"
brew "yarn"
brew "zlib"
brew "zoxide"
brew "clojure/tools/clojure"
brew "coursier/formulas/coursier"
brew "d12frosted/emacs-plus/emacs-plus@28"
brew "hashicorp/tap/vault"
brew "jesseduffield/lazygit/lazygit"
brew "pkgxdev/made/pkgx"
brew "scalacenter/bloop/bloop"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "brave-browser"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "devtoys"
cask "discord"
cask "docker"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-source-code-pro"
cask "gitkraken"
cask "gstreamer-runtime"
cask "hammerspoon"
cask "karabiner-elements"
cask "kitty"
cask "miniconda"
cask "postbird"
cask "postman"
cask "shortcat"
cask "visual-studio-code"
cask "whatsapp"
cask "whichspace"
cask "wine-stable"
mas "1Blocker", id: 1365531024
mas "1Password 7", id: 1333542190
mas "Apnea Trainer", id: 1216253186
mas "Express Scribe Transcription", id: 1163880535
mas "Freeze", id: 1046095491
mas "GarageBand", id: 682658836
mas "GitHub Wiki Search", id: 1594190145
mas "iMovie", id: 408981434
mas "iReal Pro", id: 409035833
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Notability", id: 360593530
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "PDF Reader Pro Lite", id: 919472673
mas "PocketTube", id: 1533703891
mas "Prime Video", id: 545519333
mas "Save to Raindrop.io", id: 1549370672
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Tempus Stopwatch", id: 1491326665
mas "The Unarchiver", id: 425424353
mas "Time Out", id: 402592703
mas "Toggl Track", id: 1291898086
mas "Transcriptions", id: 911974149
mas "Trello", id: 1278508951
vscode "aaron-bond.better-comments"
vscode "alexcvzz.vscode-sqlite"
vscode "alfnielsen.vsc-rename-files"
vscode "andenetalexander.vim-cheatsheet"
vscode "arrterian.nix-env-selector"
vscode "asvetliakov.vscode-neovim"
vscode "bbenoist.nix"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc"
vscode "chrisdias.vscode-opennewinstance"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dunstontc.vscode-docker-syntax"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "frhtylcn.pythonsnippets"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "haskell.haskell"
vscode "hoovercj.haskell-linter"
vscode "iceworks-team.iceworks-time-master"
vscode "innoverio.vscode-dbt-power-user"
vscode "iterative.dvc"
vscode "jannisx11.batch-rename-extension"
vscode "julianiaquinandi.nvim-ui-modifier"
vscode "justusadam.language-haskell"
vscode "kejun.devtoys"
vscode "kevinrose.vsc-python-indent"
vscode "ktnrg45.vscode-cython"
vscode "luozhihao.call-graph"
vscode "markis.code-coverage"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mogeko.haskell-extension-pack"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "phoityne.phoityne-vscode"
vscode "redhat.vscode-yaml"
vscode "rsbondi.highlight-words"
vscode "ryu1kn.partial-diff"
vscode "samuelcolvin.jinjahtml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sourcery.sourcery"
vscode "tomoki1207.pdf"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "youssef.viow"
vscode "yzhang.markdown-all-in-one"
