tap "browsh-org/browsh"
tap "clojure/tools"
tap "coursier/formulas"
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "microsoft/git"
tap "microsoft/mssql-release"
tap "noahgorstein/tap"
tap "saulpw/vd"
tap "scalacenter/bloop"
tap "snyk/tap"
tap "yakitrak/yakitrak"
tap "zegervdv/zathura"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# General-purpose data compression with high compression ratio
brew "xz"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# C parser in Python
brew "pycparser", link: false
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# YAML Parser
brew "libyaml"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Next generation open source RPC library and framework
brew "grpc"
# Framework for scalable cross-language services development
brew "thrift"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Development kit for the Java programming language
brew "openjdk@17"
# Engine for large-scale data processing
brew "apache-spark"
# Record and share terminal sessions
brew "asciinema"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Text processing scripting language
brew "awk"
# GNU database manager
brew "gdbm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion", link: false
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Parser generator
brew "bison"
# New way to see and navigate directory trees
brew "broot"
# Elegant Lua unit testing
brew "busted"
# Text-based personal organizer
brew "calcurse"
# CLI Swiss Army Knife for ChatGPT
brew "chatblade"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# GNU compiler collection
brew "gcc"
# Bindings to the libgit2 shared library
brew "pygit2"
# Git for data science projects
brew "dvc"
# Generic library support script
brew "libtool"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Spellchecker wrapping library
brew "enchant"
# Run arbitrary commands when files change
brew "entr"
# Command-line EPUB reader
brew "epr"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Alternative to top/htop
brew "glances"
# Render markdown on the CLI
brew "glow"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# CLI email client written in Rust
brew "himalaya"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Website copier/offline browser
brew "httrack"
# Platform built on V8 to build network applications
brew "node", link: false
# High precision scientific calculator with support for physical units
brew "insect"
# Synchronize a maildir with an IMAP server
brew "isync"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# LastPass command-line interface tool
brew "lastpass-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Pager program similar to more
brew "less"
# Portable Foreign Function Interface library
brew "libffi"
# LLVM's OpenMP runtime library
brew "libomp"
# Rainbows and unicorns in your console!
brew "lolcat"
# Package manager for the Lua programming language
brew "luarocks"
# Bare libuv bindings for lua
brew "luv"
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# Small build system for use with gyp or CMake
brew "ninja"
# Remote terminal application
brew "mosh"
# Powerful paging program
brew "most"
# Media player based on MPlayer and mplayer2
brew "mpv"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# NCurses Disk Usage
brew "ncdu"
# Cross-platform ncurses Spotify client written in Rust
brew "ncspot"
# Thread-based email index, search, and tagging
brew "notmuch"
# E-mail reader with support for Notmuch, NNTP and much more
brew "neomutt"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Statically typed compiled systems programming language
brew "nim"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# OCaml package manager
brew "opam"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Modern replacement for ps written by Rust
brew "procs"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# File browser
brew "ranger"
# Tools to work with human-editable, plain text data files
brew "recutils"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Rust toolchain installer
brew "rustup-init"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# JVM-based programming language
brew "scala"
# SOund eXchange: universal sound sample translator
brew "sox"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Cross-shell prompt for astronauts
brew "starship"
# Feature-rich console based todo list manager
brew "task"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Terminal user interface for taskwarrior
brew "taskwarrior-tui"
# Code-search similar to ack
brew "the_silver_searcher"
# Command-line time tracking application
brew "timewarrior"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Tmux session manager. Built on libtmux
brew "tmuxp"
# Full-screen terminal interface for Taskwarrior
brew "vit"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Access X11 clipboards from the command-line
brew "xclip"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja"
# Hackable, minimal, fast TUI file explorer
brew "xplr"
# Fast CSV toolkit written in Rust
brew "xsv"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl", args: ["HEAD"], link: false
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# The Clojure Programming Language
brew "clojure/tools/clojure"
# Launcher for Coursier
brew "coursier/formulas/coursier"
brew "d12frosted/emacs-plus/emacs-plus@28"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Vault
brew "hashicorp/tap/vault"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql18"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools18"
# a TUI playground to experiment and play with jq
brew "noahgorstein/tap/jqp"
# Installs the Bloop CLI for Bloop, a build server to compile, test and run Scala fast
brew "scalacenter/bloop/bloop"
# Find & fix known vulnerabilities in open-source dependencies
brew "snyk/tap/snyk"
brew "yakitrak/yakitrak/obs"
# PDF viewer
brew "zegervdv/zathura/zathura"
# MuPDF backend plugin for zathura
brew "zegervdv/zathura/zathura-pdf-mupdf"
# Time tracker
cask "activitywatch"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Chromium based browser
cask "arc"
# Graphical configurator for Dygma Raise keyboards
cask "bazecor"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Keyboard-only application launcher
cask "dmenu-mac"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
cask "font-source-code-pro"
cask "git-credential-manager-core"
# Git client focusing on productivity
cask "gitkraken"
# Desktop automation application
cask "hammerspoon"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Open-source keystroke visualizer
cask "keycastr"
# Screen and video recording software
cask "loom"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Minimal installer for conda
cask "miniconda"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source PostgreSQL GUI client
cask "postbird"
# Collaboration platform for API development
cask "postman"
# Keyboard-driven, vim-like browser based on PyQt5
cask "qutebrowser"
# Video chat, voice call and instant messaging application
cask "skype"
# Music streaming service
cask "spotify"
# Backup, recovery and cloning software
cask "superduper"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Active space menu bar icon
cask "whichspace"
# Compatibility layer to run Windows applications
cask "wine-stable"
mas "1Blocker", id: 1365531024
mas "1Password 7", id: 1333542190
mas "Apnea Trainer", id: 1216253186
mas "Endel", id: 1346247457
mas "Express Scribe Transcription", id: 1163880535
mas "Freeze", id: 1046095491
mas "GarageBand", id: 682658836
mas "GitHub Wiki Search", id: 1594190145
mas "iMovie", id: 408981434
mas "iReal Pro", id: 409035833
mas "Kindle", id: 405399194
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Noizio Lite", id: 1481029536
mas "Notability", id: 360593530
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "PDF Reader", id: 615956269
mas "PocketTube", id: 1533703891
mas "Prime Video", id: 545519333
mas "QuickShade", id: 931571202
mas "Save to Raindrop.io", id: 1549370672
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Tempus Stopwatch", id: 1491326665
mas "The Unarchiver", id: 425424353
mas "Time Out", id: 402592703
mas "Toggl Track", id: 1291898086
mas "Transcriptions", id: 911974149
mas "Trello", id: 1278508951
mas "Twingate", id: 1501592214
vscode "aaron-bond.better-comments"
vscode "alexcvzz.vscode-sqlite"
vscode "alfnielsen.vsc-rename-files"
vscode "AndenetAlexander.vim-cheatsheet"
vscode "arrterian.nix-env-selector"
vscode "asvetliakov.vscode-neovim"
vscode "bbenoist.Nix"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bierner.markdown-mermaid"
vscode "Catppuccin.catppuccin-vsc"
vscode "chrisdias.vscode-opennewinstance"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dunstontc.vscode-docker-syntax"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "frhtylcn.pythonsnippets"
vscode "george-alisson.html-preview-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GrapeCity.gc-excelviewer"
vscode "Gruntfuggly.todo-tree"
vscode "haskell.haskell"
vscode "hoovercj.haskell-linter"
vscode "iceworks-team.iceworks-time-master"
vscode "innoverio.vscode-dbt-power-user"
vscode "iterative.dvc"
vscode "JannisX11.batch-rename-extension"
vscode "JulianIaquinandi.nvim-ui-modifier"
vscode "justusadam.language-haskell"
vscode "kejun.devtoys"
vscode "KevinRose.vsc-python-indent"
vscode "ktnrg45.vscode-cython"
vscode "LuoZhihao.call-graph"
vscode "markis.code-coverage"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mogeko.haskell-extension-pack"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "njpwerner.autodocstring"
vscode "phoityne.phoityne-vscode"
vscode "redhat.vscode-yaml"
vscode "rsbondi.highlight-words"
vscode "ryu1kn.partial-diff"
vscode "samuelcolvin.jinjahtml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sourcegraph.cody-ai"
vscode "sourcery.sourcery"
vscode "tomoki1207.pdf"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "Youssef.viow"
vscode "yzhang.markdown-all-in-one"
